/**
 * 拓扑图--东莞凤岗网络拓扑
 */
const lineInfo = [
  /*
  * FG-INT-S2960-01 con FG-INT-S2960-02
  */
  {
    from: 'FG-INT-S2960-01',
    to: 'FG-INT-S2960-02',
    coords: [
      [625, 890],
      [775, 890]
    ]
  },
  {
    from: 'FG-INT-S2960-02',
    to: 'FG-INT-S2960-01',
    coords: [
      [775, 890],
      [625, 890]
    ]
  },
  /*
  * 电信 con FG-INT-S2960-01
  */
  {
    from: '电信',
    to: 'FG-INT-S2960-01',
    coords: [
      [550, 980],
      [550, 940],
      [620, 940],
      [620, 890]
    ]
  },
  {
    from: 'FG-INT-S2960-01',
    to: '电信',
    coords: [
      [620, 890],
      [620, 940],
      [550, 940],
      [550, 980]
    ]
  },
  /*
  * 移动 con FG-INT-S2960-01
  */
  {
    from: '移动',
    to: 'FG-INT-S2960-01',
    coords: [
      [700, 980],
      [700, 940],
      [630, 940],
      [630, 890]
    ]
  },
  {
    from: 'FG-INT-S2960-01',
    to: '移动',
    coords: [
      [630, 890],
      [630, 940],
      [700, 940],
      [700, 980]
    ]
  },

  /*
  * 联通 con FG-INT-S2960-02
  */
  {
    from: '联通',
    to: 'FG-INT-S2960-02',
    coords: [
      [850, 980],
      [850, 940],
      [775, 940],
      [775, 890]
    ]
  },
  {
    from: 'FG-INT-S2960-02',
    to: '联通',
    coords: [
      [775, 890],
      [775, 940],
      [850, 940],
      [850, 980]
    ]
  },

  /*
  * ALLOT流控等 con 接入层
  */
  {
    from: 'ALLOT流控',
    to: 'FG-INT-S2960-01',
    coords: [
      [280, 890],
      [280, 920],
      [514, 920]
    ]
  },
  {
    from: 'FG-INT-S2960-01',
    to: 'ALLOT流控',
    coords: [
      [514, 920],
      [280, 920],
      [280, 890]
    ]
  },
  {
    from: 'WAF',
    to: 'FG-INT-S2960-01',
    coords: [
      [360, 890],
      [360, 920],
      [514, 920]
    ]
  },
  {
    from: 'FG-INT-S2960-01',
    to: 'WAF',
    coords: [
      [514, 920],
      [360, 920],
      [360, 890]
    ]
  },
  {
    from: 'ADSDDOS',
    to: 'FG-INT-S2960-01',
    coords: [
      [440, 890],
      [440, 920],
      [514, 920]
    ]
  },
  {
    from: 'FG-INT-S2960-01',
    to: 'ADSDDOS',
    coords: [
      [514, 920],
      [440, 920],
      [440, 890]
    ]
  },

  {
    from: 'ALLOT流控',
    to: 'FG-INT-S2960-02',
    coords: [
      [280, 890],
      [280, 920],
      [514, 920]
    ]
  },
  {
    from: 'FG-INT-S2960-02',
    to: 'ALLOT流控',
    coords: [
      [514, 920],
      [280, 920],
      [280, 890]
    ]
  },
  {
    from: 'WAF',
    to: 'FG-INT-S2960-02',
    coords: [
      [360, 890],
      [360, 920],
      [514, 920]
    ]
  },
  {
    from: 'FG-INT-S2960-02',
    to: 'WAF',
    coords: [
      [514, 920],
      [360, 920],
      [360, 890]
    ]
  },
  {
    from: 'ADSDDOS',
    to: 'FG-INT-S2960-02',
    coords: [
      [440, 890],
      [440, 920],
      [514, 920]
    ]
  },
  {
    from: 'FG-INT-S2960-02',
    to: 'ADSDDOS',
    coords: [
      [514, 920],
      [440, 920],
      [440, 890]
    ]
  },

  /**
   * 互联网DMZ区
   */
  {
    from: 'FG-INT-S2960-01',
    to: 'FG-INT-F3220-01',
    coords: [
      [560, 835],
      [560, 790]
    ]
  },
  {
    from: 'FG-INT-F3220-01',
    to: 'FG-INT-S2960-01',
    coords: [
      [560, 835],
      [560, 790]
    ]
  },
  {
    from: 'FG-INT-S2960-02',
    to: 'FG-INT-F3220-01',
    coords: [
      [560, 835],
      [560, 790]
    ]
  },
  {
    from: 'FG-INT-F3220-01',
    to: 'FG-INT-S2960-02',
    coords: [
      [560, 835],
      [560, 790]
    ]
  },
  {
    from: '线路接入层',
    to: '互联网DMZ区',
    coords: [
      [570, 835],
      [570, 790]
    ]
  },
  {
    from: '互联网DMZ区',
    to: '线路接入层',
    coords: [
      [570, 835],
      [570, 790]
    ]
  },

  {
    from: 'FG-INT-S2960-01',
    to: 'FG-INT-F3220-02',
    coords: [
      [580, 835],
      [580, 790]
    ]
  },
  {
    from: 'FG-INT-F3220-02',
    to: 'FG-INT-S2960-01',
    coords: [
      [580, 835],
      [580, 790]
    ]
  },
  {
    from: 'FG-INT-S2960-02',
    to: 'FG-INT-F3220-02',
    coords: [
      [580, 835],
      [580, 790]
    ]
  },
  {
    from: 'FG-INT-F3220-02',
    to: 'FG-INT-S2960-02',
    coords: [
      [580, 835],
      [580, 790]
    ]
  },

  {
    from: 'FG-INT-F3220-02',
    to: 'FG-INT-F3220-01',
    coords: [
      [580, 740],
      [470, 740]
    ]
  },
  {
    from: 'FG-INT-F3220-01',
    to: 'FG-INT-F3220-02',
    coords: [
      [470, 740],
      [580, 740]
    ]
  },

  {
    from: 'FG-INT-F3220-01',
    to: 'FG-COR-S9504-01',
    coords: [
      [470, 740],
      [470, 500]
    ]
  },
  {
    from: 'FG-COR-S9504-01',
    to: 'FG-INT-F3220-01',
    coords: [
      [470, 500],
      [470, 740]
    ]
  },

  {
    from: 'FG-INT-F3220-02',
    to: '后海机房',
    coords: [
      [590, 740],
      [590, 810],
      [1090, 810],
      [1090, 650]
    ]
  },
  {
    from: '后海机房',
    to: 'FG-INT-F3220-02',
    coords: [
      [1090, 650],
      [1090, 810],
      [590, 810],
      [590, 740]
    ]
  },

  {
    from: 'FG-INT-F3220-02',
    to: 'FG-COR-S9504-02',
    coords: [
      [590, 740],
      [590, 660],
      [935, 660],
      [935, 500]
    ]
  },
  {
    from: 'FG-COR-S9504-02',
    to: 'FG-INT-F3220-02',
    coords: [
      [935, 500],
      [935, 660],
      [590, 660],
      [590, 740]
    ]
  },

  /**
   * 营业部DMZ区
   */
  {
    from: 'FG-SOD-F2860-01',
    to: 'FFG-SOD-F2860-02',
    coords: [
      [810, 740],
      [930, 740]
    ]
  },
  {
    from: 'FFG-SOD-F2860-02',
    to: 'FG-SOD-F2860-01',
    coords: [
      [930, 740],
      [810, 740]
    ]
  },

  {
    from: 'FG-INT-S2960-01',
    to: 'FG-SOD-F2860-01',
    coords: [
      [810, 835],
      [810, 790]
    ]
  },
  {
    from: 'FG-SOD-F2860-01',
    to: 'FG-INT-S2960-01',
    coords: [
      [810, 835],
      [810, 790]
    ]
  },
  {
    from: 'FG-INT-S2960-02',
    to: 'FG-SOD-F2860-01',
    coords: [
      [810, 835],
      [810, 790]
    ]
  },
  {
    from: 'FG-SOD-F2860-01',
    to: 'FG-INT-S2960-02',
    coords: [
      [810, 835],
      [810, 790]
    ]
  },
  {
    from: '营业部DMZ区',
    to: '互联网DMZ区',
    coords: [
      [820, 835],
      [820, 790]
    ]
  },
  {
    from: '互联网DMZ区',
    to: '营业部DMZ区',
    coords: [
      [820, 835],
      [820, 790]
    ]
  },
  {
    from: 'FG-INT-S2960-01',
    to: 'FFG-SOD-F2860-02',
    coords: [
      [830, 835],
      [830, 790]
    ]
  },
  {
    from: 'FFG-SOD-F2860-02',
    to: 'FG-INT-S2960-01',
    coords: [
      [830, 835],
      [830, 790]
    ]
  },
  {
    from: 'FG-INT-S2960-02',
    to: 'FFG-SOD-F2860-02',
    coords: [
      [830, 835],
      [830, 790]
    ]
  },
  {
    from: 'FFG-SOD-F2860-02',
    to: 'FG-INT-S2960-02',
    coords: [
      [830, 835],
      [830, 790]
    ]
  },

  {
    from: 'FG-SOD-F2860-01',
    to: 'FG-COR-S9504-01',
    coords: [
      [810, 740],
      [810, 635],
      [475, 635],
      [475, 500]
    ]
  },
  {
    from: 'FG-COR-S9504-01',
    to: 'FG-SOD-F2860-01',
    coords: [
      [475, 500],
      [475, 635],
      [810, 635],
      [810, 740]
    ]
  },
  {
    from: 'FG-COR-S9504-02',
    to: 'FFG-SOD-F2860-02',
    coords: [
      [930, 500],
      [930, 740]
    ]
  },
  {
    from: 'FFG-SOD-F2860-02',
    to: 'FG-COR-S9504-02',
    coords: [
      [930, 740],
      [930, 500]
    ]
  },

  /**
   * FG-COR-F5260-01,FG-COR-F5260-02
   */
  {
    from: 'FG-COR-F5260-01',
    to: 'FG-COR-F5260-02',
    coords: [
      [590, 600],
      [810, 600]
    ]
  },
  {
    from: 'FG-COR-F5260-02',
    to: 'FG-COR-F5260-01',
    coords: [
      [750, 600],
      [810, 600]
    ]
  },
  {
    from: 'FG-COR-F5260-01',
    to: 'FG-COR-S9504-01',
    coords: [
      [590, 600],
      [480, 600],
      [480, 500]
    ]
  },
  {
    from: 'FG-COR-S9504-01',
    to: 'FG-COR-F5260-01',
    coords: [
      [480, 500],
      [480, 600],
      [590, 600]
    ]
  },
  {
    from: 'FG-COR-F5260-02',
    to: 'FG-COR-S9504-02',
    coords: [
      [810, 600],
      [925, 600],
      [925, 500]
    ]
  },
  {
    from: 'FG-COR-S9504-02',
    to: 'FG-COR-F5260-02',
    coords: [
      [925, 500],
      [925, 600],
      [810, 600]
    ]
  },
  /**
     * FG-COR-S9504
     */
  {
    from: 'FG-COR-S9504-01',
    to: 'FG-NTRA-S93180-01',
    coords: [
      [470, 500],
      [870, 360]
    ]
  },
  {
    from: 'FG-NTRA-S93180-01',
    to: 'FG-COR-S9504-01',
    coords: [
      [870, 360],
      [470, 500]
    ]
  },
  {
    from: 'FG-COR-S9504-02',
    to: 'FG-TRA-S93180-02',
    coords: [
      [930, 500],
      [530, 360]
    ]
  },
  {
    from: 'FG-TRA-S93180-02',
    to: 'FG-COR-S9504-02',
    coords: [
      [530, 360],
      [930, 500]
    ]
  },
  {
    from: 'FG-COR-S9504-01',
    to: 'FG-EXT-F2860-01',
    coords: [
      [465, 510],
      [0, 510],
      [0, 450]
    ]
  },
  {
    from: 'FG-EXT-F2860-01',
    to: 'FG-COR-S9504-01',
    coords: [
      [0, 450],
      [0, 510],
      [465, 510]
    ]
  },
  {
    from: 'FG-COR-S9504-01',
    to: 'FG-EXT-F2860-02',
    coords: [
      [465, 500],
      [80, 500],
      [80, 450]
    ]
  },
  {
    from: 'FG-EXT-F2860-02',
    to: 'FG-COR-S9504-01',
    coords: [
      [80, 450],
      [80, 500],
      [465, 500]
    ]
  },

  {
    from: 'FG-COR-S9504-01',
    to: 'FG-TRA-S93180-01',
    coords: [
      [465, 490],
      [430, 490],
      [430, 360]
    ]
  },
  {
    from: 'FG-TRA-S93180-01',
    to: 'FG-COR-S9504-01',
    coords: [
      [430, 360],
      [430, 490],
      [465, 490]
    ]
  },
  {
    from: 'FG-COR-S9504-02',
    to: '后海机房',
    coords: [
      [930, 500],
      [1085, 500],
      [1085, 585]
    ]
  },
  {
    from: '后海机房',
    to: 'FG-COR-S9504-02',
    coords: [
      [1085, 585],
      [1085, 500],
      [930, 500]
    ]
  },
  {
    from: 'FG-COR-S9504-02',
    to: 'FG-NTRA-S93180-02',
    coords: [
      [930, 490],
      [970, 490],
      [970, 360]
    ]
  },
  {
    from: 'FG-NTRA-S93180-02',
    to: 'FG-COR-S9504-02',
    coords: [
      [970, 360],
      [970, 490],
      [930, 490]
    ]
  },
  /**
     * FG-EXT-F2860-01,FG-EXT-F2860-02
     */
  {
    from: 'FG-EXT-F2860-01',
    to: 'FG-EXT-F2860-02',
    coords: [
      [0, 450],
      [80, 450]
    ]
  },
  {
    from: 'FG-EXT-F2860-02',
    to: 'FG-EXT-F2860-01',
    coords: [
      [80, 450],
      [0, 450]
    ]
  },
  /**
     * 外联区
     */
  {
    from: 'FG-EXT-S2960-01',
    to: 'FG-EXT-S2960-02',
    coords: [
      [0, 260],
      [80, 260]
    ]
  },
  {
    from: 'FG-EXT-S2960-02',
    to: 'FG-EXT-S2960-01',
    coords: [
      [80, 260],
      [0, 260]
    ]
  },
  {
    from: 'FG-EXT-S2960-01',
    to: 'FG-EXT-F2860-01',
    coords: [
      [0, 315],
      [0, 405]
    ]
  },
  {
    from: 'FG-EXT-F2860-01',
    to: 'FG-EXT-S2960-01',
    coords: [
      [0, 405],
      [0, 315]
    ]
  },
  {
    from: 'FG-EXT-S2960-02',
    to: 'FG-EXT-F2860-02',
    coords: [
      [80, 315],
      [80, 405]
    ]
  },
  {
    from: 'FG-EXT-F2860-02',
    to: 'FG-EXT-S2960-02',
    coords: [
      [80, 405],
      [80, 315]
    ]
  },
  {
    from: 'FG-EXT-S2960-01',
    to: 'FG-EXT-R4331-01',
    coords: [
      [0, 260],
      [0, 160]
    ]
  },
  {
    from: 'FG-EXT-R4331-01',
    to: 'FG-EXT-S2960-01',
    coords: [
      [0, 160],
      [0, 260]
    ]
  },
  {
    from: 'FG-EXT-S2960-02',
    to: 'FG-EXT-R4331-02',
    coords: [
      [80, 260],
      [80, 160]
    ]
  },
  {
    from: 'FG-EXT-R4331-02',
    to: 'FG-EXT-S2960-02',
    coords: [
      [80, 160],
      [80, 260]
    ]
  },
  /**
     * 报盘、行情区
     */
  {
    from: 'FG-ARISTA-01',
    to: 'FG-ARISTA-02',
    coords: [
      [180, 260],
      [260, 260]
    ]
  },
  {
    from: 'FG-ARISTA-02',
    to: 'FG-ARISTA-01',
    coords: [
      [260, 260],
      [180, 260]
    ]
  },
  {
    from: 'FG-ARISTA-01',
    to: 'FG-LEVEL2-01',
    coords: [
      [180, 260],
      [180, 160]
    ]
  },
  {
    from: 'FG-LEVEL2-01',
    to: 'FG-ARISTA-01',
    coords: [
      [180, 160],
      [180, 260]
    ]
  },
  {
    from: 'FG-LEVEL2-02',
    to: 'FG-ARISTA-02',
    coords: [
      [260, 160],
      [260, 260]
    ]
  },
  {
    from: 'FG-ARISTA-02',
    to: 'FG-LEVEL2-02',
    coords: [
      [260, 260],
      [260, 160]
    ]
  },
  {
    from: 'FG-ARISTA-01',
    to: 'FG-TRA-S93180-01',
    coords: [
      [180, 260],
      [180, 360],
      [430, 360]
    ]
  },
  {
    from: 'FG-TRA-S93180-01',
    to: 'FG-ARISTA-01',
    coords: [
      [430, 360],
      [180, 360],
      [180, 260]
    ]
  },
  {
    from: 'FG-ARISTA-02',
    to: 'FG-TRA-S93180-02',
    coords: [
      [260, 260],
      [260, 450],
      [530, 450],
      [530, 360]
    ]
  },
  {
    from: 'FG-TRA-S93180-02',
    to: 'FG-ARISTA-02',
    coords: [
      [530, 360],
      [530, 450],
      [260, 450],
      [260, 260]
    ]
  },
  /**
     * 交易区
     */
  {
    from: 'FG-TRA-S93180-01',
    to: '交易接入设备1',
    coords: [
      [430, 360],
      [370, 190]
    ]
  },
  {
    from: '交易接入设备1',
    to: 'FG-TRA-S93180-01',
    coords: [
      [370, 190],
      [430, 360]
    ]
  },

  {
    from: 'FG-TRA-S93180-01',
    to: '虚拟化设备1',
    coords: [
      [430, 360],
      [650, 190]
    ]
  },
  {
    from: '虚拟化设备1',
    to: 'FG-TRA-S93180-01',
    coords: [
      [650, 190],
      [430, 360]
    ]
  },

  {
    from: '交易接入设备2',
    to: 'FG-TRA-S93180-02',
    coords: [
      [470, 190],
      [530, 360]
    ]
  },
  {
    from: 'FG-TRA-S93180-02',
    to: '交易接入设备2',
    coords: [
      [530, 360],
      [470, 190]
    ]
  },
  {
    from: '虚拟化设备2',
    to: 'FG-TRA-S93180-02',
    coords: [
      [750, 190],
      [530, 360]
    ]
  },
  {
    from: 'FG-TRA-S93180-02',
    to: '虚拟化设备2',
    coords: [
      [530, 360],
      [750, 190]
    ]
  },
  {
    from: 'FG-TRA-S93180-02',
    to: '后海机房',
    coords: [
      [530, 360],
      [530, 105],
      [1095, 105],
      [1095, 585]
    ]
  },
  /**
     * 非交易区
     */
  {
    from: 'FG-NTRA-S93180-01',
    to: '虚拟化设备1',
    coords: [
      [870, 360],
      [650, 190]
    ]
  },
  {
    from: '虚拟化设备1',
    to: 'FG-NTRA-S93180-01',
    coords: [
      [650, 190],
      [870, 360]
    ]
  },
  {
    from: 'FG-NTRA-S93180-01',
    to: '非交易接入设备1',
    coords: [
      [870, 360],
      [930, 190]
    ]
  },
  {
    from: '非交易接入设备1',
    to: 'FG-NTRA-S93180-01',
    coords: [
      [930, 190],
      [870, 360]
    ]
  },

  {
    from: 'FG-NTRA-S93180-02',
    to: '虚拟化设备2',
    coords: [
      [970, 360],
      [750, 190]
    ]
  },
  {
    from: '虚拟化设备2',
    to: 'FG-NTRA-S93180-01',
    coords: [
      [750, 190],
      [970, 360]
    ]
  },
  {
    from: 'FG-NTRA-S93180-02',
    to: '非交易接入设备2',
    coords: [
      [970, 360],
      [1030, 190]
    ]
  },
  {
    from: '非交易接入设备2',
    to: 'FG-NTRA-S93180-02',
    coords: [
      [1030, 190],
      [970, 360]
    ]
  },
  {
    from: '非交易区',
    to: '后海机房',
    coords: [
      [1015, 350],
      [1090, 350],
      [1090, 585]
    ]
  },
  {
    from: '后海机房',
    to: '非交易区',
    coords: [
      [1090, 585],
      [1090, 350],
      [1015, 350]
    ]
  },
  {
    from: 'FG-NTRA-S93180-01',
    to: '后海机房',
    coords: [
      [1015, 350],
      [1090, 350],
      [1090, 585]
    ]
  },
  {
    from: '后海机房',
    to: 'FG-NTRA-S93180-01',
    coords: [
      [1090, 585],
      [1090, 350],
      [1015, 350]
    ]
  },
  {
    from: 'FG-NTRA-S93180-02',
    to: '后海机房',
    coords: [
      [1015, 350],
      [1090, 350],
      [1090, 585]
    ]
  },
  {
    from: '后海机房',
    to: 'FG-NTRA-S93180-02',
    coords: [
      [1090, 585],
      [1090, 350],
      [1015, 350]
    ]
  },
  /**
     * 交易接入区
     */
  {
    from: '交易接入设备1',
    to: '交易接入设备2',
    coords: [
      [370, 190],
      [470, 190]
    ]
  },
  {
    from: '交易接入设备2',
    to: '交易接入设备1',
    coords: [
      [470, 190],
      [370, 190]
    ]
  },
  /**
     * 交易接入非交易虚拟化区
     */
  {
    from: '虚拟化设备1',
    to: '虚拟化设备2',
    coords: [
      [650, 190],
      [750, 190]
    ]
  },
  {
    from: '虚拟化设备2',
    to: '虚拟化设备1',
    coords: [
      [750, 190],
      [650, 190]
    ]
  },
  /**
     * 非交易接入区
     */
  {
    from: '非交易接入设备1',
    to: '非交易接入设备2',
    coords: [
      [930, 190],
      [1030, 190]
    ]
  },
  {
    from: '非交易接入设备2',
    to: '非交易接入设备1',
    coords: [
      [1030, 190],
      [930, 190]
    ]
  },
  /**
     * pc光纤网络
     */
  {
    from: '后海机房',
    to: 'pc光纤网络',
    coords: [
      [1100, 585],
      [1100, 35],
      [795, 35]
    ]
  },
  {
    from: 'pc光纤网络',
    to: '后海机房',
    coords: [
      [795, 35],
      [1100, 35],
      [1100, 585]
    ]
  },
  {
    from: '后海机房',
    to: 'FG-DS6510-01',
    coords: [
      [1100, 585],
      [1100, 35],
      [795, 35]
    ]
  },
  {
    from: 'FG-DS6510-01',
    to: '后海机房',
    coords: [
      [795, 35],
      [1100, 35],
      [1100, 585]
    ]
  },
  {
    from: '后海机房',
    to: 'FG-DS6510-02',
    coords: [
      [1100, 585],
      [1100, 35],
      [795, 35]
    ]
  },
  {
    from: 'FG-DS6510-02',
    to: '后海机房',
    coords: [
      [795, 35],
      [1100, 35],
      [1100, 585]
    ]
  },
  {
    from: 'FG-DS6510-02',
    to: 'FG-DS6510-01',
    coords: [
      [750, 35],
      [650, 35]
    ]
  },
  {
    from: 'FG-DS6510-01',
    to: 'FG-DS6510-02',
    coords: [
      [650, 35],
      [750, 35]
    ]
  }
]
export default lineInfo
