/**
 * 拓扑图--恒生pb
 */
const hengshengPB = [
  /**
   * 外接系统层
   */
  {
    x: 970,
    y: 1105,
    name: '外接系统层',
    type: 'frame'
  },
  {
    x: 375,
    y: 990,
    name: '二级KCXP1',
    type: 'KCXP',
    status: 0,
    line: [
      {
        target: '分仓前置1',
        status: 0,
        value: [
          [375, 830],
          [450, 830],
          [450, 800],
          [375, 800]
        ]
      },
      {
        target: '分仓前置2',
        status: 0,
        value: [
          [375, 830],
          [450, 830],
          [450, 800],
          [525, 800]
        ]
      }
    ]
  },
  {
    x: 525,
    y: 990,
    name: '二级KCXP2',
    type: 'KCXP',
    status: 0,
    line: [
      {
        target: '分仓前置1',
        status: 0,
        value: [
          [525, 830],
          [450, 830],
          [450, 800],
          [375, 800]
        ]
      },
      {
        target: '分仓前置2',
        status: 0,
        value: [
          [525, 830],
          [450, 830],
          [450, 800],
          [525, 800]
        ]
      }
    ]
  },
  /**
   * 行情报盘服务层
   */
  {
    x: 970,
    y: 803,
    name: '行情报盘服务层',
    type: 'frame'
  },
  {
    x: 75,
    y: 685,
    name: '算法服务1',
    type: '服务器',
    status: 0,
    line: [
      {
        target: '中间件as、ar1',
        status: 0,
        value: [
          [75, 580],
          [75, 520],
          [200, 520],
          [200, 480],
          [350, 480]
        ]
      },
      {
        target: '中间件as、ar2',
        status: 0,
        value: [
          [75, 580],
          [75, 520],
          [200, 520],
          [200, 480],
          [550, 480]
        ]
      },
      {
        target: 'DB1',
        status: 0,
        value: [
          [75, 580],
          [75, 520],
          [200, 520],
          [200, 200],
          [350, 200]
        ]
      },
      {
        target: 'DB2',
        status: 0,
        value: [
          [75, 580],
          [75, 520],
          [200, 520],
          [200, 200],
          [550, 200]
        ]
      }
    ]
  },
  {
    x: 225,
    y: 685,
    name: '算法服务2',
    type: '服务器',
    status: 0,
    line: [
      {
        target: '中间件as、ar1',
        status: 0,
        value: [
          [225, 580],
          [225, 520],
          [200, 520],
          [200, 480],
          [350, 480]
        ]
      },
      {
        target: '中间件as、ar2',
        status: 0,
        value: [
          [225, 580],
          [225, 520],
          [200, 520],
          [200, 480],
          [550, 480]
        ]
      },
      {
        target: 'DB1',
        status: 0,
        value: [
          [225, 580],
          [225, 520],
          [200, 520],
          [200, 200],
          [350, 200]
        ]
      },
      {
        target: 'DB2',
        status: 0,
        value: [
          [225, 580],
          [225, 520],
          [200, 520],
          [200, 200],
          [550, 200]
        ]
      }
    ]
  },
  {
    x: 375,
    y: 685,
    name: '分仓前置1',
    type: '磁盘',
    status: 0,
    line: [
      {
        target: '二级KCXP2',
        status: 0,
        value: [
          [375, 800],
          [450, 800],
          [450, 830],
          [525, 830]
        ]
      },
      {
        target: '二级KCXP1',
        status: 0,
        value: [
          [375, 800],
          [450, 800],
          [450, 830],
          [375, 830]
        ]
      },
      {
        target: '中间件as、ar2',
        status: 0,
        value: [
          [200, 520],
          [200, 480],
          [550, 480]
        ]
      },
      {
        target: 'DB1',
        status: 0,
        value: [
          [200, 520],
          [200, 200],
          [350, 200]
        ]
      },
      {
        target: 'DB2',
        status: 0,
        value: [
          [200, 520],
          [200, 200],
          [550, 200]
        ]
      }
    ]
  },
  {
    x: 525,
    y: 685,
    name: '分仓前置2',
    type: '磁盘',
    status: 0,
    line: [
      {
        target: '二级KCXP2',
        status: 0,
        value: [
          [525, 800],
          [450, 800],
          [450, 830],
          [525, 830]
        ]
      },
      {
        target: '二级KCXP1',
        status: 0,
        value: [
          [525, 800],
          [450, 800],
          [450, 830],
          [375, 830]
        ]
      },
      {
        target: '中间件as、ar2',
        status: 0,
        value: [
          [525, 520],
          [200, 520],
          [200, 480],
          [550, 480]
        ]
      },
      {
        target: 'DB1',
        status: 0,
        value: [
          [525, 520],
          [200, 520],
          [200, 200],
          [350, 200]
        ]
      },
      {
        target: 'DB2',
        status: 0,
        value: [
          [525, 520],
          [200, 520],
          [200, 200],
          [550, 200]
        ]
      }
    ]
  },
  {
    x: 675,
    y: 685,
    name: '期货行情',
    type: '行情',
    status: 0,
    line: [
      {
        target: '中间件as、ar1',
        status: 0,
        value: [
          [675, 520],
          [750, 520],
          [750, 200],
          [350, 200]
        ]
      },
      {
        target: '中间件as、ar2',
        status: 0,
        value: [
          [675, 520],
          [750, 520],
          [750, 200],
          [550, 200]
        ]
      },
      {
        target: 'DB1',
        status: 0,
        value: [
          [675, 520],
          [750, 520],
          [750, 200],
          [350, 200],
          [350, 85]
        ]
      },
      {
        target: 'DB2',
        status: 0,
        value: [
          [675, 520],
          [750, 520],
          [750, 200],
          [550, 200],
          [550, 85]
        ]
      }
    ]
  },
  {
    x: 825,
    y: 685,
    name: '现货行情',
    type: '行情',
    status: 0,
    line: [
      {
        target: '中间件as、ar1',
        status: 0,
        value: [
          [825, 520],
          [750, 520],
          [750, 200],
          [350, 200]
        ]
      },
      {
        target: '中间件as、ar2',
        status: 0,
        value: [
          [825, 520],
          [750, 520],
          [750, 200],
          [550, 200]
        ]
      },
      {
        target: 'DB1',
        status: 0,
        value: [
          [825, 520],
          [750, 520],
          [750, 200],
          [350, 200],
          [350, 85]
        ]
      },
      {
        target: 'DB2',
        status: 0,
        value: [
          [825, 520],
          [750, 520],
          [750, 200],
          [550, 200],
          [550, 85]
        ]
      }
    ]
  },
  /**
   * 恒生中间件层
   */
  {
    x: 970,
    y: 500,
    name: '恒生中间件层',
    type: 'frame'
  },
  {
    x: 350,
    y: 385,
    name: '中间件as、ar1',
    type: '中间件',
    status: 0,
    line: [
      {
        target: 'DB2',
        status: 0,
        value: [
          [350, 200],
          [550, 200]
        ]
      },
      {
        target: 'DB1',
        status: 0,
        value: [ ]
      },
      {
        target: '算法服务1',
        status: 0,
        value: [
          [350, 430],
          [350, 480],
          [200, 480],
          [200, 520],
          [75, 520]
        ]
      },
      {
        target: '算法服务2',
        status: 0,
        value: [
          [350, 430],
          [350, 480],
          [200, 480],
          [200, 520],
          [225, 520]
        ]
      },
      {
        target: '分仓前置1',
        status: 0,
        value: [
          [350, 430],
          [350, 480],
          [200, 480],
          [200, 520],
          [375, 520]
        ]
      },
      {
        target: '分仓前置2',
        status: 0,
        value: [
          [350, 430],
          [350, 480],
          [200, 480],
          [200, 520],
          [525, 520]
        ]
      },
      {
        target: '期货行情',
        status: 0,
        value: [
          [350, 200],
          [750, 200],
          [750, 520],
          [675, 520]
        ]
      },
      {
        target: '现货行情',
        status: 0,
        value: [
          [350, 200],
          [750, 200],
          [750, 520],
          [825, 520]
        ]
      }
    ]
  },
  {
    x: 550,
    y: 385,
    name: '中间件as、ar2',
    type: '中间件',
    status: 0,
    line: [
      {
        target: 'DB1',
        status: 0,
        value: [
          [550, 200],
          [350, 200]
        ]
      },
      {
        target: 'DB2',
        status: 0,
        value: [ ]
      },
      {
        target: '算法服务1',
        status: 0,
        value: [
          [550, 430],
          [550, 480],
          [200, 480],
          [200, 520],
          [75, 520]
        ]
      },
      {
        target: '算法服务2',
        status: 0,
        value: [
          [550, 430],
          [550, 480],
          [200, 480],
          [200, 520],
          [225, 520]
        ]
      },
      {
        target: '分仓前置1',
        status: 0,
        value: [
          [550, 430],
          [550, 480],
          [200, 480],
          [200, 520],
          [375, 520]
        ]
      },
      {
        target: '分仓前置2',
        status: 0,
        value: [
          [550, 430],
          [550, 480],
          [200, 480],
          [200, 520],
          [525, 520]
        ]
      },
      {
        target: '期货行情',
        status: 0,
        value: [
          [550, 200],
          [750, 200],
          [750, 520],
          [675, 520]
        ]
      },
      {
        target: '现货行情',
        status: 0,
        value: [
          [550, 200],
          [750, 200],
          [750, 520],
          [825, 520]
        ]
      }
    ]
  },
  /**
   * 数据库层
   */
  {
    x: 970,
    y: 195,
    name: '数据库层',
    type: 'frame'
  },
  {
    x: 350,
    y: 85,
    name: 'DB1',
    type: '数据库',
    status: 0,
    line: [
      {
        target: '中间件as、ar1',
        status: 0,
        value: [ ]
      },
      {
        target: '中间件as、ar2',
        status: 0,
        value: [
          [350, 200],
          [550, 200]
        ]
      },
      {
        target: '算法服务1',
        status: 0,
        value: [
          [350, 200],
          [200, 200],
          [200, 520],
          [75, 520]
        ]
      },
      {
        target: '算法服务2',
        status: 0,
        value: [
          [350, 200],
          [200, 200],
          [200, 520],
          [225, 520]
        ]
      },
      {
        target: '分仓前置1',
        status: 0,
        value: [
          [350, 200],
          [200, 200],
          [200, 520],
          [375, 520]
        ]
      },
      {
        target: '分仓前置2',
        status: 0,
        value: [
          [350, 200],
          [200, 200],
          [200, 520],
          [525, 520]
        ]
      },
      {
        target: '期货行情',
        status: 0,
        value: [
          [350, 200],
          [750, 200],
          [750, 520],
          [675, 520]
        ]
      },
      {
        target: '现货行情',
        status: 0,
        value: [
          [350, 200],
          [750, 200],
          [750, 520],
          [825, 520]
        ]
      }
    ]
  },
  {
    x: 550,
    y: 85,
    name: 'DB2',
    type: '数据库',
    status: 0,
    line: [
      {
        target: '中间件as、ar2',
        status: 0,
        value: [ ]
      },
      {
        target: '中间件as、ar1',
        status: 0,
        value: [
          [550, 200],
          [350, 200]
        ]
      },
      {
        target: '算法服务1',
        status: 0,
        value: [
          [550, 200],
          [200, 200],
          [200, 520],
          [75, 520]
        ]
      },
      {
        target: '算法服务2',
        status: 0,
        value: [
          [550, 200],
          [200, 200],
          [200, 520],
          [225, 520]
        ]
      },
      {
        target: '分仓前置1',
        status: 0,
        value: [
          [550, 200],
          [200, 200],
          [200, 520],
          [375, 520]
        ]
      },
      {
        target: '分仓前置2',
        status: 0,
        value: [
          [550, 200],
          [200, 200],
          [200, 520],
          [525, 520]
        ]
      },
      {
        target: '期货行情',
        status: 0,
        value: [
          [550, 200],
          [750, 200],
          [750, 520],
          [675, 520]
        ]
      },
      {
        target: '现货行情',
        status: 0,
        value: [
          [550, 200],
          [750, 200],
          [750, 520],
          [825, 520]
        ]
      }
    ]
  }
]
export default hengshengPB
