export const right1Data = [
  {
    group: '零售关键数据折线图',
    data: [
      '委托笔数数据', '成交笔数数据', '开户业务数据', '银证转账数据', '中登流水数据', '操作流水数据'
    ]
  }
]

export const right2Data = [
  {
    group: '机构关键数据折线图',
    data: [
      '恒生pb-委托笔数数据', '恒生pb-成交笔数数据', '迅投pb-委托笔数数据', '迅投pb-成交笔数数据', '络町pb-委托笔数数据', '络町pb-成交笔数数据'
    ]
  }
]


export const right3Data = [
  {
    group: '机构关键数据折线图',
    data: [
      '量化家-委托笔数数据', '量化家-成交笔数数据'
    ]
  },
  {
    group: '自营关键数据折线图',
    data: [
      '委托笔数数据', '成交笔数数据', '交易指令数据', '操作流水数据'
    ]
  }
]
