
export const left1Data = [
  {
    group: '零售数据承载视图',
    data: [
      'fs网关连接数', 'KCXP连接数', 'KCBP服务统计', '数据库交易委托', '数据库交易成交'
    ]
  }
]

export const left2Data = [
  {
    group: '量化家',
    data: [
      '实盘在线数', '数据库交易委托', '数据库交易成交'
    ]
  },
  {
    group: '迅投pb',
    data: [
      '行情转入', '数据库交易委托', '数据库交易成交'
    ]
  },
  {
    group: '络町pb',
    data: [
      '行情转入', '数据库交易委托', '数据库交易成交'
    ]
  }
]

export const left3Data = [
  {
    group: '恒生pb',
    data: [
      '行情转入情况', '现货分仓前置机接受请求', '数据库交易成功', '数据库交易委托'
    ]
  },
  {
    group: '自营数据承载视图',
    data: [
      '深圳业务处理', '上海业务处理', '数据库交易委托', '数据库交易成交', '现货行情转入', '外汇固收行情转入'
    ]
  }
]
// export const left1Data = [
//   {
//     group: '零售数据承载视图',
//     data: [
//       '凤岗-fs网关连接数', '凤岗-KCXP连接数', '凤岗-KCBP服务情况统计', '凤岗-数据库交易委托', '凤岗-数据库成交情况', '后海-fs网关连接数', '后海-KCXP连接数', '后海-KCBP服务情况统计', '后海-数据库交易委托',
//       '后海-数据库成交情况', '金桥-fs网关连接数', '金桥-KCXP连接数', '金桥-KCBP服务情况统计', '金桥-数据库交易委托', '金桥-数据库交易委托', '金桥-数据库成交情况'
//     ]
//   },
//   {
//     group: '恒生pb',
//     data: [
//       '凤岗-行情转入情况', '凤岗-现货分仓前置机', '凤岗-数据库交易委托', '后海-数据库交易委托', '金桥-数据库交易委托', '后海-行情转入情况', '后海-现货分仓前置机', '凤岗-数据库成交情况', '后海-数据库成交情况', '金桥-数据库成交情况'
//     ]
//   }
// ]

// export const left2Data = [
//   {
//     group: '迅投pb',
//     data: [
//       '凤岗-数据库交易委托', '后海-数据库交易委托', '金桥-数据库交易委托', '凤岗-行情转入情况', '后海-行情转入情况', '凤岗-数据库成交情况', '后海-数据库成交情况', '金桥-数据库成交情况', '金桥-行情转入情况'
//     ]
//   },
//   {
//     group: '恒生pb',
//     data: [
//       '金桥-行情转入情况', '金桥-现货分仓前置机'
//     ]
//   },
//   {
//     group: '络町pb',
//     data: [
//       '凤岗-数据库交易委托', '后海-数据库交易委托', '金桥-数据库交易委托', '凤岗-行情转入情况', '后海-行情转入情况', '凤岗-数据库成交情况', '后海-数据库成交情况', '金桥-数据库成交情况', '金桥-行情转入情况'
//     ]
//   },
//   {
//     group: '量化家',
//     data: [
//       '凤岗-数据库交易委托', '后海-数据库交易委托', '金桥-数据库交易委托', '凤岗-google网页界面', '后海-google网页界面'
//     ]
//   }
// ]

// export const left3Data = [
//   {
//     group: '自营数据承载视图',
//     data: [
//       '凤岗-深圳业务处理情况', '凤岗-上海业务处理情况', '凤岗-股转业务处理情况', '凤岗-数据库交易委托', '凤岗-数据库成交情况', '后海-深圳业务处理情况', '后海-上海业务处理情况', '后海-股转业务处理情况',
//       '后海-数据库交易委托', '后海-数据库成交情况', '金桥-深圳业务处理情况', '金桥-上海业务处理情况', '金桥-股转业务处理情况', '金桥-数据库交易委托', '金桥-数据库成交情况', '凤岗-现货行情转入情况',
//       '后海-现货行情转入情况', '金桥-现货行情转入情况', '凤岗-外汇固收行情转入', '后海-外汇固收行情转入', '金桥-外汇固收行情转入'
//     ]
//   },
//   {
//     group: '量化家',
//     data: [
//       '凤岗-数据库成交情况', '后海-数据库成交情况', '金桥-数据库成交情况', '凤岗-google网页界面'
//     ]
//   }
// ]
