export default {
  "渠道外联层": {
    "员工工作平台": ["AD系统", "邮件", "文件云", "邮件归档", "oa办公", "财务核算", "财务营改增", "财务发票", "门户网站", "人力资源", "办公APP", "零售客户终端"],
    "零售客户终端": ["通达信", "同花顺", "中焯", "网上营业厅", "理财商城"],
    "外联接入": ["证联网", "机构外联", "固收外联"],
    "报盘接入": ["深交所", "上交所", "登记公司", "北交所"]
  },
  "总线/接入层": {
    "总线接入": ["KESB总线", "FS网关"],
    "二级接入": ["二级KCXP", "WebService"],
    "统一认证": ["统一认证"]
  },
  "业务应用非交易": {
    "风险控制": ["反洗钱", "合规管理", "风险管理", "净资本", "异常交易", "市场风险", "信用风险", "流动性风险", "操作风险", "监管报表", "港融CISP", "港融FISP"],
    "运营支撑": ["ITSM", "自动化运维", "集中监控", "软件下发", "数据脱敏", "仿真探测", "项目管理"],
    "集中运营": ["非现场", "综合运营"],
    "营销服务": ["多渠道营销", "营销服务", "投顾营销", "微服务"],
    "资讯管理": ["万得资讯", "同花顺资讯"]
  },
  "业务应用交易": {
    "零售经纪/财富管理": ["集中交易", "融资融券", "股票期权", "账户系统", "转融通", "OTC系统"],
    "机构经纪": ["恒生PB", "机构柜台", "迅投PB", "络町pb"],
    "资产管理": ["海益资管", "恒生TA", "资管估值"],
    "投行": ["投行业务", "投行底稿", "投研管理", "投行IPO"],
    "自营": ["O3.2", "海益固收", "海益信用风险", "国债期货", "自营估值", "固收模拟"],
    "快订量化": ["快速订单", "智策PB", "智卜PB", "量化家"]
  },
  "业务应用企业数据": {
    "企业数据平台": ["数据平台", "行为分析", "标签画像", "相似K线"]
  },
  "公共服务": {
    "产品中心": ["产品中心"],
    "支付中心": ["资金管理"],
    "清算中心": ["法人清算", "运营保障", "银企划付"]
  }
}