/**
 * 拓扑图--迅投pb
 */
const xuntouPB = [
  /**
   * 外接系统层
   */
  {
    x: 0,
    y: 1025,
    name: '外接系统层',
    type: 'frame'
  },
  {
    x: 350,
    y: 1000,
    name: '集中交易KCXP1',
    type: 'KCXP',
    line: [
      {
        target: '交易前置机1',
        status: 0,
        value: [
          [350, 875],
          [550, 875],
          [550, 825],
          [350, 825]
        ]
      },
      {
        target: '交易前置机2',
        status: 0,
        value: [
          [350, 875],
          [550, 875],
          [550, 825],
          [750, 825]
        ]
      }
    ]
  },
  {
    x: 750,
    y: 1000,
    name: '集中交易KCXP2',
    type: 'KCXP',
    line: [
      {
        target: '交易前置机1',
        status: 0,
        value: [
          [750, 875],
          [550, 875],
          [550, 825],
          [350, 825]
        ]
      },
      {
        target: '交易前置机2',
        status: 0,
        value: [
          [750, 875],
          [550, 875],
          [550, 825],
          [750, 825]
        ]
      }
    ]
  },
  /**
   * 交易服务层
   */
  {
    x: 0,
    y: 775,
    name: '交易服务层',
    type: 'frame'
  },
  {
    x: 350,
    y: 750,
    name: '交易前置机1',
    type: '磁盘',
    line: [
      {
        target: '集中交易KCXP1',
        status: 0,
        value: [
          [350, 825],
          [550, 825],
          [550, 875],
          [350, 875]
        ]
      },
      {
        target: '集中交易KCXP2',
        status: 0,
        value: [
          [350, 825],
          [550, 825],
          [550, 875],
          [750, 875]
        ]
      },
      {
        target: 'DB1',
        status: 0,
        value: [
          [350, 615],
          [150, 615],
          [150, 75],
          [350, 75]
        ]
      },
      {
        target: '行情前置机1',
        status: 0,
        value: [
          [350, 615],
          [550, 615],
          [550, 400],
          [250, 400]
        ]
      },
      {
        target: '行情前置机2',
        status: 0,
        value: [
          [350, 615],
          [550, 615],
          [550, 400],
          [450, 400]
        ]
      },
      {
        target: '期货行情交易1',
        status: 0,
        value: [
          [350, 615],
          [550, 615],
          [550, 400],
          [650, 400]
        ]
      },
      {
        target: '期货行情交易2',
        status: 0,
        value: [
          [350, 615],
          [550, 615],
          [550, 400],
          [900, 400]
        ]
      }
    ]
  },
  {
    x: 750,
    y: 750,
    name: '交易前置机2',
    type: '磁盘',
    line: [
      {
        target: '集中交易KCXP1',
        status: 0,
        value: [
          [750, 825],
          [550, 825],
          [550, 875],
          [350, 875]
        ]
      },
      {
        target: '集中交易KCXP2',
        status: 0,
        value: [
          [750, 825],
          [550, 825],
          [550, 875],
          [750, 875]
        ]
      },
      {
        target: '行情前置机1',
        status: 0,
        value: [
          [750, 615],
          [550, 615],
          [550, 400],
          [250, 400]
        ]
      },
      {
        target: '行情前置机2',
        status: 0,
        value: [
          [750, 615],
          [550, 615],
          [550, 400],
          [450, 400]
        ]
      },
      {
        target: '期货行情交易1',
        status: 0,
        value: [
          [750, 615],
          [550, 615],
          [550, 400],
          [650, 400]
        ]
      },
      {
        target: '期货行情交易2',
        status: 0,
        value: [
          [750, 615],
          [550, 615],
          [550, 400],
          [900, 400]
        ]
      }
    ]
  },
  /**
   * 行情服务层
   */
  {
    x: 0,
    y: 575,
    name: '行情服务层',
    type: 'frame'
  },
  {
    x: 250,
    y: 550,
    name: '行情前置机1',
    type: '磁盘',
    line: [
      {
        target: 'DB2',
        status: 0,
        value: [
          [250, 400],
          [950, 400],
          [950, 75],
          [750, 75]
        ]
      },
      {
        target: 'DB1',
        status: 0,
        value: [
          [150, 550],
          [150, 75],
          [350, 75]
        ]
      },
      {
        target: '交易前置机1',
        status: 0,
        value: [
          [250, 400],
          [550, 400],
          [550, 615],
          [350, 615]
        ]
      },
      {
        target: '交易前置机2',
        status: 0,
        value: [
          [250, 400],
          [550, 400],
          [550, 615],
          [750, 615]
        ]
      }
    ]
  },
  {
    x: 450,
    y: 550,
    name: '行情前置机2',
    type: '磁盘',
    line: [
      {
        target: 'DB1',
        status: 0,
        value: [
          [450, 400],
          [950, 400],
          [950, 75],
          [350, 75]
        ]
      },
      {
        target: 'DB2',
        status: 0,
        value: [
          [450, 400],
          [950, 400],
          [950, 75],
          [750, 75]
        ]
      },
      {
        target: '交易前置机1',
        status: 0,
        value: [
          [450, 400],
          [550, 400],
          [550, 615],
          [350, 615]
        ]
      },
      {
        target: '交易前置机2',
        status: 0,
        value: [
          [450, 400],
          [550, 400],
          [550, 615],
          [750, 615]
        ]
      }
    ]
  },
  {
    x: 650,
    y: 550,
    name: '期货行情交易1',
    type: '行情',
    line: [
      {
        target: 'DB1',
        status: 0,
        value: [
          [650, 400],
          [950, 400],
          [950, 75],
          [350, 75]
        ]
      },
      {
        target: 'DB2',
        status: 0,
        value: [
          [650, 400],
          [950, 400],
          [950, 75],
          [750, 75]
        ]
      },
      {
        target: '交易前置机1',
        status: 0,
        value: [
          [650, 400],
          [550, 400],
          [550, 615],
          [350, 615]
        ]
      },
      {
        target: '交易前置机2',
        status: 0,
        value: [
          [650, 400],
          [550, 400],
          [550, 615],
          [750, 615]
        ]
      }
    ]
  },
  {
    x: 900,
    y: 550,
    name: '期货行情交易2',
    type: '行情',
    line: [
      {
        target: 'DB1',
        status: 0,
        value: [
          [900, 400],
          [950, 400],
          [950, 75],
          [350, 75]
        ]
      },
      {
        target: 'DB2',
        status: 0,
        value: [
          [900, 400],
          [950, 400],
          [950, 75],
          [750, 75]
        ]
      },
      {
        target: '交易前置机1',
        status: 0,
        value: [
          [900, 400],
          [550, 400],
          [550, 615],
          [350, 615]
        ]
      },
      {
        target: '交易前置机2',
        status: 0,
        value: [
          [900, 400],
          [550, 400],
          [550, 615],
          [750, 615]
        ]
      }
    ]
  },
  /**
   * 算法服务层
   */
  {
    x: 0,
    y: 275,
    name: '算法服务层',
    type: 'frame'
  },
  {
    x: 350,
    y: 250,
    name: '算法服务1',
    type: '策略',
    line: [
      {
        target: 'DB1',
        status: 0,
        value: [
          [350, 125],
          [550, 125],
          [550, 75],
          [350, 75]
        ]
      },
      {
        target: 'DB2',
        status: 0,
        value: [
          [350, 125],
          [550, 125],
          [550, 75],
          [750, 75]
        ]
      },
      {
        target: '交易前置机1',
        status: 0,
        value: [
          [350, 125],
          [550, 125],
          [550, 75],
          [150, 75],
          [150, 615],
          [350, 615]
        ]
      },
      {
        target: '交易前置机2',
        status: 0,
        value: [
          [350, 125],
          [550, 125],
          [550, 75],
          [150, 75],
          [150, 615],
          [750, 615]
        ]
      }
    ]
  },
  {
    x: 750,
    y: 250,
    name: '算法服务2',
    type: '策略',
    line: [
      {
        target: 'DB1',
        status: 0,
        value: [
          [750, 125],
          [550, 125],
          [550, 75],
          [350, 75]
        ]
      },
      {
        target: 'DB2',
        status: 0,
        value: [
          [750, 125],
          [550, 125],
          [550, 75],
          [750, 75]
        ]
      },
      {
        target: '交易前置机1',
        status: 0,
        value: [
          [750, 125],
          [550, 125],
          [550, 75],
          [150, 75],
          [150, 615],
          [350, 615]
        ]
      },
      {
        target: '交易前置机2',
        status: 0,
        value: [
          [750, 125],
          [550, 125],
          [550, 75],
          [150, 75],
          [150, 615],
          [750, 615]
        ]
      }
    ]
  },
  /**
   * 数据库层
   */
  {
    x: 0,
    y: 25,
    name: '数据库层',
    type: 'frame'
  },
  {
    x: 350,
    y: 0,
    name: 'DB1',
    type: '数据库',
    line: [
      {
        target: '算法服务1',
        status: 0,
        value: [
          [350, 75],
          [550, 75],
          [550, 125],
          [350, 125]
        ]
      },
      {
        target: '算法服务2',
        status: 0,
        value: [
          [350, 75],
          [550, 75],
          [550, 125],
          [750, 125]
        ]
      },
      {
        target: '行情前置机1',
        status: 0,
        value: [
          [350, 75],
          [150, 75],
          [150, 550]
        ]
      },
      {
        target: '交易前置机1',
        status: 0,
        value: [
          [350, 75],
          [150, 75],
          [150, 615],
          [350, 615]
        ]
      },
      {
        target: '交易前置机2',
        status: 0,
        value: [
          [350, 75],
          [150, 75],
          [150, 615],
          [750, 615]
        ]
      }
    ]
  },
  {
    x: 750,
    y: 0,
    name: 'DB2',
    type: '数据库',
    line: [
      {
        target: '算法服务1',
        status: 0,
        value: [
          [750, 75],
          [550, 75],
          [550, 125],
          [350, 125]
        ]
      },
      {
        target: '算法服务2',
        status: 0,
        value: [
          [750, 75],
          [550, 75],
          [550, 125],
          [750, 125]
        ]
      },
      {
        target: '行情前置机1',
        status: 0,
        value: [
          [750, 75],
          [950, 75],
          [950, 400],
          [250, 400]
        ]
      },
      {
        target: '行情前置机2',
        status: 0,
        value: [
          [750, 75],
          [950, 75],
          [950, 400],
          [450, 400]
        ]
      },
      {
        target: '期货行情交易1',
        status: 0,
        value: [
          [750, 75],
          [950, 75],
          [950, 400],
          [650, 400]
        ]
      },
      {
        target: '期货行情交易2',
        status: 0,
        value: [
          [750, 75],
          [950, 75],
          [950, 400],
          [900, 400]
        ]
      },
      {
        target: '交易前置机1',
        status: 0,
        value: [
          [750, 75],
          [150, 75],
          [150, 615],
          [350, 615]
        ]
      },
      {
        target: '交易前置机2',
        status: 0,
        value: [
          [750, 75],
          [150, 75],
          [150, 615],
          [750, 615]
        ]
      }
    ]
  }
]
export default xuntouPB
